Autodesk.Revit.DB.Fabrication.FabricationPartFitResult
Fabrication part stretch/fill result.
Since:
2017
Since:
2017

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.Unsupported
Failed due to unsupported routing path.

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.OffsetRequired
Failed due to additional offset dimensions or fittings being required that weren't available.

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.IncompatibleConnection
Failed due to connectors being incompatible and no couplings found to resolve it.

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.SizeMismatch
Failed due to size mismatch of fitting ends.

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.ShapeMismatch
Failed due to shape mismatch of fitting ends.

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.BadDimensions
Failed due to the required dimension values not being valid to fabricate.

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.DimensionLocked
Failed due to not being able to change a locked or product listed dimension.

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.MisalignedEnds
Failed due to misalignment of fitting ends.

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.IncompatibleGeometry
Failed because the part didn't have the dimensions required to meet the geometry requirements.

Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.Success
Operation was successful.